# Casks

tap "caskroom/cask"
tap "caskrook/homebrew-fonts"

# Development tools

brew "ag"
brew "autoenv"
brew "cloc"
brew "ctags"
brew "direnv"
brew "fzf"
brew "git"
brew "gh"
brew "gpg"
brew "gpg2"
brew "gpg-agent"
brew "graphviz"
brew "hub"
brew "jq"
brew "pv"
brew "tig"
brew "vim"

# Golang

brew install "go"

# Node

brew "nvm"

# Ruby

brew "chruby"
brew "ruby-install"

# Databases

brew "redis"
brew "postgresql"
brew "postgis"

# Networking tools

brew "mtr"
brew "nmap"
cask "wireshark"

# Terminal

cask "iterm2"
brew "zsh"
brew "tmux"
brew "reattach-to-user-namespace"
brew "z"

# Fonts

cask "source-code-pro"
cask "hack"

# Heroku

brew "heroku/brew/heroku"

# Other tools

cask "virtualbox"

brew "docker-machine"
brew "packer"
brew "tree"
brew "gnu-tar"

cask "ngrok"

cask "flux"
cask "slack"
cask "skype"
cask "spotify"
cask "toggl"
cask "yubiswitch"
