# Casks

tap "caskroom/cask"
tap "caskrook/homebrew-fonts"

# Development tools

brew "ag"
brew "autoenv"
brew "cloc"
brew "colordiff"
brew "ctags"
brew "git"
brew "gh"
brew "gpg"
brew "heroku-toolbelt"
brew "hub"
brew "jq"
brew "mercurial"
brew "pv"
brew "tig"
brew "vim"
brew "wrk"

# Node

brew "nvm"

# Ruby

brew "chruby"
brew "ruby-install"

# Databases

brew "redis"
brew "postgresql"
brew "postgis"

# Networking tools

brew "mtr"
brew "nmap"
brew "s3cmd"
cask "wireshark"

# Arduino

cask "arduino"

# Tex

cask "pandoc"
cask "basictex"

# Terminal

cask "iterm2"
brew "zsh"
brew "tmux"
brew "reattach-to-user-namespace"
brew "z"

# Fonts

cask "source-code-pro"
cask "hack"

# Other tools

cask "textexpander"
cask "virtualbox"
cask "vagrant"

brew "docker-machine"
brew "packer"
brew "tree"
brew "gist"
brew "gnu-tar"

cask "ngrok"

cask "flux"
cask "dropbox"
brew "exiv2"
brew "ffmpeg"
brew "gifsicle"
brew "imagemagick"
cask "omnifocus"
cask "screenhero"
cask "skype"
cask "spotify"
cask "transmission"
brew "ufraw"
cask "vlc"
cask "xquartz"
cask "yubiswitch"
